import { Injectable } from "@nestjs/common";
import { DailyEntity } from "../entity/daily.entity";
import { ItineraryEntity } from "../entity/itinerary.entity";

@Injectable()
export class DailyService {
  getDailyItinerary(): DailyEntity[] {
    return [
      new DailyEntity("交通禮儀、道亦有道", "師生自行航空登錄、行李檢查、取登機證、通關步驟，長野の『道の駅』理解與台灣高速公路休息站的不同，農産物直売所也銷售長野縣農產品。", "d1.jpeg", [
        new ItineraryEntity("06:10", "桃園機場集合"),
        new ItineraryEntity("08:50 ~ 13:15", "桃園空港2航廈 CI100 => 成田空港"),
        new ItineraryEntity("14:20", "到着後専用バスで長野県へ\n" +
          "高速公路休息站及農產品產銷中心"),
        new ItineraryEntity("18:20", "ロイヤルホテル長野(泊)")
      ]),
      new DailyEntity("長商百貨、農家寄宿", "1.參加長野縣商業高校的歡迎會，該校1900年(明治33年)に創立され、西暦2020年に創立120周年を迎える学校です。\n\n有名的長商デパート，模擬百貨公司的營運與行銷大賽「西日本名産品」、「東日本名産品」、「そば処」、「長商亭」、「屋台Ⅰ」、「屋台Ⅱ」、「スイーツ」、「鮮魚」、「農産物」、「オモチャ」、「アウトドア」、「園芸」、「家庭用品」、「物産品」、「菓子」、「食料品」、「商品企画開発部」(社員販売)，體驗該校全國9連霸的競技啦啦隊，弓道社的聚精會神，參與化學課程、摺紙藝術的學習，體育課一起打壘球，午餐便當的林林總總，歡送會的依依不捨。\n\n" +
        "2.農家民宿周遭生活體驗，民宿家庭料理體驗，酒廠製作、天文望遠鏡的觀賞，水果甜點製作，外語的溝通等。", "", [
        new ItineraryEntity("08:45", "ホテル発"),
        new ItineraryEntity("09:15", "長野商業高校着"),
        new ItineraryEntity("10:00", "長野商業高等学校を訪問して交流(昼食含む)"),
        new ItineraryEntity("10:30", "歡迎會\n\n" +
          "行程 B: 10:30-12:00 蘇科長、于校長、張瓊文科員、曾主任、廖老師拜訪長野縣教育委員會，返回長商。\n\n" +
          "1900 年(明治 33 年)に創立され、西暦 2020 年に創立 120 周年を迎える学校です。"),
        new ItineraryEntity("14:10 ~ 15:30", "社團課程體驗\n\n大合照\n\n長商デパート，模擬百貨公司的營運與行銷大賽\n" +
          "「西日本名産品」、「東日本名産品」、「そば処」、「長商亭」、「屋台Ⅰ」、「屋台Ⅱ」、「スイーツ」、「鮮魚」、「農産物」、「オモチャ」、「アウトドア」、「園芸」、「家庭用品」、「物産品」、「菓子」、「食料品」、「商品企画開発部」(社員販売)"),
        new ItineraryEntity("16:15", "国宝善光寺見学 https://www.zenkoji.jp/\n\n" +
          "善光寺擁有約 1,400 年悠久歷史，其「本堂」不僅被指定為日本國寶，也是東日本最大的木造文化財建築物。不隸屬任何派別的善光寺，號稱「日本人一生必去的」\n\n須坂市民泊着\n\n農家民宿(先行洗溫泉再入農家)\n\n實際入住日本農家，體驗住家附近農業的耕作，學習日式家庭料理，日語的溝通與互動。")
      ]),
      new DailyEntity("農業改良、林檎栽種", "1.長野県では、「農業試験場」、「果樹試験場」、「野菜花き試験場」、「畜産試験場」、「南信農業試験場」、「水産試験場」の6つの試験場を設置して，這次主要針對農業試驗場及果樹試驗場的學習體驗。\n\n" +
        "2.利基技術開發方向、信州原生種開發、減輕環境負荷的技術開發、AI、ICT的先端技術開發，往省力(資源)及自動化的開發方向、能適應氣候暖化的農產品開發。\n\n" +
        "3.生產現場的問題解決技術開發、低成本、輕作業化、大規模的水田輪作體系調整。\n\n" +
        "4.農業範疇的知識產權的保護與活用。", "", [
        new ItineraryEntity("08:45", "民泊発"),
        new ItineraryEntity("09:15", "長野県農業関係試験場 https://www.agries-nagano.jp/ (須坂市)着"),
        new ItineraryEntity("09:30 ~ 11:00", "見学時間(会場で説明&質疑応答)\n\n" +
          "1. 長野県では、「農業試験場」、「果樹試験場」、「野菜花き試験場」、「畜産試験場」、「南信農業試験場」、「水産試験場」の 6 つの試験場を設置して，這次主要針對農業試驗場及果樹試驗場的學習體驗。\n\n" +
          "2. 利基技術開發方向、信州原生種開發、減輕環境負荷的 技術開發、AI、ICT 的先端技術開發，往省力(資源)及 自動化的開發方向、能適應氣候暖化的農產品開發。\n\n" +
          "3. 生產現場的問題解決技術開發、低成本、輕作業化、大 規模的水田輪作體系調整。\n\n" +
          "4. 農業範疇的知識產權的保護與活用。"),
        new ItineraryEntity("11:15 ~ 12:00", "中条フルーツ農業 https://www.fruitsland.co.jp/facility/suzaka/見学 (林檎園見学)(主要果物栽種有蘋果、葡萄、水蜜桃、櫻 桃、川中島白桃等)"),
        new ItineraryEntity("12:15 ~ 13:30", "須坂市・「湯つ蔵んど」昼食"),
        new ItineraryEntity("13:40 ~ 17:30", "往東京車程"),
        new ItineraryEntity("17:30 ~ 18:40", "晚餐\n\n■店舗:土風炉池袋東口店\n" +
          "Tofuro Ikebukuro higashiguchi\n\n" +
          "■団体名: 新北市 2023 年薦送高中職学生\n\n" +
          "■人数:36 名+添乗員 1 名同食別席\n\n" +
          "■メニュー:\n" +
          "・胡麻豆冨、・茶碗蒸し、・握り鮨 2 貫、・揚げ物盛り合わ せ、鶏唐揚げ/海老唐揚げ/ポテトフライ/カニクリーム コロッケ、・ご飯、味噌汁、・デザート\n\n■支払い:現地精算\n\n" +
          "■当日連絡先:050-5539-5391\n\n■お席はいくつかに別々のお席に分かれます。"),
        new ItineraryEntity("19:10", "東京三井ガーデンホテル五反田(泊)")
      ]),
      new DailyEntity("鋼彈工場、全日航空", "1.電車體驗與教學，模擬坐電車無法上車或與團體被分開後，包含因為雷擊造成鐵道無法運行時，如何解決問題。\n\n" +
        "2. 鋼彈工廠體驗GUNDAM FACTORY YOKOHAMA，啟動實驗、STANDBY MODE、全套與半套喚醒動作。展示 18 公尺高的等比例可動 RX-78 初代鋼彈AI動作。\n\n" +
        "3. ANA Blue Base航空整備場見學體驗，見学施設は、グランドスタッフ、客室乗務員、貨物スタッフ、グランドハンドリングスタッフ、整備士、運航乗務員、以上6つの職種の訓練施設です。\n", "", [
        new ItineraryEntity("08:45", "五反田 到 品川 到 橫濱 港灣未來線 到 元町・中華街"),
        new ItineraryEntity("11:00", "鋼彈工廠體驗(GUNDAM FACTORY YOKOHAMA)\n啟動實驗、STANDBY MODE、全套與半套喚醒動作、設置了一座鋼彈格納庫，展示 18 公尺高的等比例可動 RX-78 初代鋼彈 AI 動作。"),
        new ItineraryEntity("12:20", "午餐 : 卡布里喬莎 橫濱元町店\n" +
          "日本〒231-0861 Kanagawa, Yokohama, Naka Ward, Motomachi, 1 Chome−31−31 ラ・スピーガ元町 2F"),
        new ItineraryEntity("13:00", "元町・中華街 到 橫濱 到 京急蒲田 穴守稻荷車站 走路到 ANA Blue Base"),
        new ItineraryEntity("14:00", "ANA ANA Blue Base 航空整備場見學體驗(分 3 組)\n\n" +
          "1グループ目:14:00-15:30\n\n" +
          "2グループ目:14:25-15:55\n\n" +
          "3グループ目:14:55-16:20\n\n弊社の見学施設は、グランドスタッフ、客室乗務員、貨物 スタッフ、グランドハンドリングスタッフ、整備士、運航 乗務員、以上 6 つの職種の訓練施設です。\n\n" +
          "自由之丘(含晚餐)\n\n" +
          "夕食予約まだ\n\n" +
          "Shichirinyakinikuanan (七輪焼肉安安自由が丘店). 類 型. 燒肉, 烤內臟, 日式小酒館. 電話・預約. 050-5457-2034 (+81-50-5457-2034)"),
        new ItineraryEntity("20:00", "東京三井ガーデンホテル五反田(泊)")
      ]),
      new DailyEntity("醬油味噌、ThinkLab", "1.明治35年創業、ヤマキ醸造主要製作味噌及醤油。\n\n有關味噌及醤油見学・体験，では「見る・聞く・触れる・香る・食べる」など五感でヤマキ醸造のものづくりに触れることができます。\n\n" +
        "2.川越老街，埼玉縣的小江戶川越是從十七世紀的江戶時代就開始發展的城下町，至今仍保留了許多日本江戶時期的古老建築群及傳統文化。\n\n" +
        "3.冰川神社至今已有 1500 年的歷史，相當靈驗，也被川越市登錄為指定文化遺產，有著日本最大的木製鳥居（15公尺）。\n\n" +
        "4.Think Laboratory シンクラボラトリー日本有名的自動化工廠，,主要是各種凹版印刷等各種微細印刷自動化，不需要人力介入，只要設計者放入設計圖案，自動地將各便利商店需要販售的產品包裝整印好。", "", [
        new ItineraryEntity("9:30 ~ 11:30", "ヤマキ醸造 https://yamaki-co.com/\n\n" +
          "明治 35 年創業、ヤマキ醸造は味噌・醤油蔵からはじまり 百年を超えるものづくりを続けています。\n\n直売店糀庵 2F\n\n" +
          "で開催する見学・体験教室では「見る・聞く・触れる・香 る・食べる」など五感でヤマキ醸造のものづくりに触れる ことができます。"),
        new ItineraryEntity("12:00 ~ ", "B 組(曾主任+13 位學生)(感謝駐東京文化辦事處文化組派車協助從ヤマキ醸造載送到)Think Laboratory シンク ラボラトリー日本有名的自動化工廠 https://www.think-lab.com/，本社工場〒277-8525 千葉県柏市高田 1201-11\n\n" +
          "製品・技術情報 :\n" +
          "全自動レーザーグラビア製版システム・水性デジタルイン クジェットシステム・微細印刷・成型ロール・DLC(Dimond Like Carbon (DLC)類鑽膜是接近鑽石特性碳膜)・デモ工場\n" +
          "/サンプル制作・消耗品・FX-eco 製版サービスについて， 台灣頂新集團使用的機器人即出自該公司,全球佔有率達六成以上。"),
        new ItineraryEntity("14:00", "藏造老街(川越老街)、冰川神社"),
        new ItineraryEntity("15:00", "鐵道博物館\n\n" +
          "新幹線、各項鐵道操作系統體驗，導覽鐵道作業系統\n\n" +
          "https://www.railway-museum.jp/"),
        new ItineraryEntity("18:30", "晚餐: すたみな太郎 亀戸店予約\n\n" +
          "https://g.co/kgs/3j1YsZ\n\n" +
          "東京都江東区亀戸 5-1-2 FRENTE 5階\n\nTEL:03-3681-3151"),
        new ItineraryEntity("20:20", "東京三井ガーデンホテル五反田(泊)")
      ]),
      new DailyEntity("日本電子、東京調理", "1.在日本電子專門學校，學習動漫製作的流程，並介紹了各種2D、3D可以完成的各項軟體與製作。\n\n" +
        "2. 東京調理製菓專門學校，體驗學習各式日式家庭料理、握壽司製作。", "", [
        new ItineraryEntity("08:30", "出發分 2 組實習學習課程"),
        new ItineraryEntity("09:00 ~ 15:00", "5/13 日本電子專門學校(12 位學生)\n19 人午餐便當(含導遊) https://www.jec.ac.jp/\n\n" +
          "東京調理製菓專門學校(10 位學生 2 位老師體驗、廖老師、 科長、曾主任、18 人午餐便當) https://www.tokyocook.ac.jp/"),
        new ItineraryEntity("15:10 ~ 17:30", "新宿-丸之內線-銀座、品牌行銷學習(UNIQLO 銀座店、GU 銀 座店、ワークマン(WORKMAN)銀座店)"),
        new ItineraryEntity("17:30", "晚餐 店舗:とり数寄東急プラザ銀座店\n\n" +
          "■日時:5 月 13 日(土)17:30\n\n" +
          "■団体名: 新北市 2023 年薦送高中職学生\n\n■人数:36 名+添乗員 1 名同食別席\n\n■メニュー:追っては送らせて頂きます。\n\n ■支払い:現地精算\n\n" +
          "■当日連絡先:050-5539-5391\n\n■お席:お席はいくつかに別々のお席に分かれます。"),
        new ItineraryEntity("19:30", "澀谷 「SCRAMBLE SQUARE」(渋谷スクランブルスクエア)"),
        new ItineraryEntity("20:20", "東京三井ガーデンホテル五反田(泊)")
      ]),
      new DailyEntity("TeamLab、水上巴士", "1. 體驗參訪由藝術團隊teamLab創作的沒有邊界的藝術群所組成，“沒有地圖的美術館”。\n\n沒有邊界的藝術會走出房間，與其他的作品產生交流。作品之間沒有界線，時而混合，時而互相影響。這些相互交融的作品，組成了一個沒有邊界互相連續的世界。\n\n" +
        "2.體驗水上巴士，沿偶田川逆流而上，觀賞13座百年鐵橋及現代彩虹大橋。", "", [
        new ItineraryEntity("08:10", "出發"),
        new ItineraryEntity("09:00 ~ 11:30", "Teamlab\n\n" +
          "Planets 豐洲 9:00~11:30 (2300學生/3500大人 /人日幣) 團員 37 張門票(22 張學生、15 張大人)"),
        new ItineraryEntity("11:30", "午飯お台場午餐 OCEAN CLUB BUFFET\n\n" +
          "+81 3-3599-6655https://g.co/kgs/gD5cJQ"),
        new ItineraryEntity("", "搭水上巴士沿隅田川−>台場海濱公園−>淺草\n\n參拜淺草觀音寺、五重塔解說"),
        new ItineraryEntity("13:30", "秋葉原站(yodobashi) 走路到 2K540 職人一條街\n\n御徒町、二木果子、大國藥妝"),
        new ItineraryEntity("14:30", "■店舗:音音上野バンブーガ―テン店\n\n" +
          "■日時:5 月 14 日(日)\n\n" +
          "■団体名: 新北市 2023 年薦送高中職学生"),
        new ItineraryEntity("18:45", "■人数:38 名+添乗員 1 名同食別席\n\n" +
          "■メニュー:彩り大名御膳+ロースとんかつ(ハーフサイ ズで)\n\n" +
          "■支払い:現地精算\n\n" +
          "■当日連絡先:050-5539-5391\n\n" +
          "■お席:フロアテーブル二つに分かれます"),
        new ItineraryEntity("20:20", "東京三井ガーデンホテル五反田(泊)")
      ]),
      new DailyEntity("東京橫斷、成田新勝", "1. 海底隧道與跨海大橋無縫接軌，川崎側為一段長9.6公里的海底隧道稱之為「AQUA Tunnel」，而木更津側為長4.4公里的跨海大橋稱之為「AQUA Bridge」，中間則興建一座龐大的人工島「海螢（Umihotaru island）」，又稱木更津人工島，以兩節海底隧道與跨海大橋。\n\n" +
        "2. 成田山新勝寺空曠悠遠，其歷史可以追溯到西元 940 年，成田表參道購物街風情怡人，且直通成田山新勝寺。\n\n新勝寺的新舊大本堂以其規模宏大、壁刻繁複而著稱；\n\n同時，寺內還有一座裝飾華美的三層佛塔和一座多寶塔風格的大塔。", "", [
        new ItineraryEntity("8:30", "巴士(由川崎方面東京橫斷道路走到海螢(海ほたる)，海螢預約團體合照"),
        new ItineraryEntity("11:30", "午餐(驗收會議)海老屋\n\n" +
          "千葉県成田市本町335番地\n\n" +
          "TEL:0476-22-2255\nFAX:0476-24-1289\n\nhttps://g.co/kgs/3nXrvq"),
        new ItineraryEntity("12:50", "成田山新勝寺"),
        new ItineraryEntity("14:30", "酒酒井"),
        new ItineraryEntity("16:00", "成田空港")
      ])
    ];
  }
}
