export const excellentWork = [
    {
        "authorName": "陳弘翔",
        "content": "這次是第一次沒有跟家人出國，難免會感覺到緊張，在新北市教育局門口上車時大家看起來都互不相識，都在做自己的事，但不知道為什麼在桃園機場的時候氣氛就活絡了起來，可能是因為要出國了，大家都很開心，就開始互相聊天，詢問對方的職種是什麼，到了日本大家都按耐不住心中的喜悅，上了交通車在上面睡了兩個小時抵達了溫泉飯店，吃自助吧的時候有點不習慣他們的口味，太清淡了，但是裡面最好吃的我覺得是牛舌，在台灣的時候很少吃到牛舌，在日本第一次吃到，很彈牙，在9點的時候再一起練習手語，雖然大家第一次的時候都忘記了，但是做一兩次後就就回憶起來了，去便利商店買宵夜的時候看到很特別的飲料想說在台灣沒有這個來喝喝看好了，也順便買了一個很特點的冰，冰吃起來很像牙膏加巧克力，但不難吃，就只是很奇異，飲料喝起來很像漱口水，但也還是不錯喝，最後和大家一起去溫泉泡澡，大家都是第一次都很緊張，但是進去之後好像就沒有那麼緊張了，泡起來很舒服，這是一個難忘的經驗。",
        "publishedDate": "5/08",
        "previewImg": "",
        "docUrl": "https://japan-study-work.s3.amazonaws.com/5:08/07陳弘翔/07陳弘翔.pdf"
    },
    {
        "authorName": "吳宗翰",
        "content": "今天是我人生第一次出國，從進到機場開始就是各種新體驗，跟機場check，出入海關，登機，搭上飛機看高空的風景，飛機準備降落時的耳鳴，到了下飛機開始聽著導遊講解日本的歷史，邊看著東京到長野的各種美景，日本真的是很美的地方，很高興第一天有這麼美好的體驗，最酷的是到要準備泡溫泉的時候，因為要全裸，所以大家都超緊張的哈哈哈，不敢坦承相見，但我想說來都來了，一定要體驗到，沒什麼好怕的，到最後大家都放開來泡，甚至玩了起來哈哈哈，泡溫泉真的滿舒服的，讓身心靈都得到了放鬆。",
        "publishedDate": "5/08",
        "previewImg": "",
        "docUrl": "https://japan-study-work.s3.amazonaws.com/5:08/08吳宗翰/08吳宗翰.pdf"
    },
    {
        "authorName": "林哲豪",
        "content": "今天一整天下來，心情的起伏變化很大，尤其是在日本出海關的時候，大家都已經出去了只剩我還在裡面，因為我的QR Code與護照的資料有不符的問題，還好後來主任有幫忙我解決這次的危機～在休息站的時候，我們有去買烏龍麵來吃，我覺得很酷的事，他們的購買方式都說使用販賣機的方法，這種方式台灣比較不普及～",
        "publishedDate": "5/08",
        "previewImg": "08_11.jpg",
        "docUrl": "https://japan-study-work.s3.amazonaws.com/5:08/11林哲豪/11林哲豪.pdf"
    },
    {
        "authorName": "洪若涵",
        "content": "第一次來日本，覺得很新奇，到處都很好奇，風景也都很好看。在飛機上雖然一直想睡覺，也幾乎都在睡覺，但覺得很好玩也很緊張，好玩的點是起飛跟降落，當 然，緊張的點也是，怕會出意外，但還好平安降落，原本以為在飛機上會吃不下東西，但結果都有吃光光，覺得我很厲害，電影也找了湯姆貓與傑利鼠來看，可是我忘記跟他要耳機，只能看無聲的。",
        "publishedDate": "5/08",
        "previewImg": "08_17.jpg",
        "docUrl": "https://japan-study-work.s3.amazonaws.com/5:08/17洪若涵/17洪若涵.pdf"
    },
    {
        "authorName": "許凱俊",
        "content": "今天在日本的旅程非常有趣。我們乘搭遊覽車從成田機場前往長野，在途中欣賞到美麗的風景和當地的文化。到了飯店後，我們享用了豐盛的Buffet，品嚐到了各種美味的料理。之後，我們參觀了當地的便利商店，這裡的商品種類繁多，令人驚喜不已。即使是在寒冷的天氣，我們也穿著短袖走路，吃著冰品，這種舒適的體驗令人難以忘懷。",
        "publishedDate": "5/08",
        "previewImg": "08_22.jpg",
        "docUrl": "https://japan-study-work.s3.amazonaws.com/5:08/22許凱俊/22許凱俊.pdf"
    },
    {
        "authorName": "黃亮瑋",
        "content": "壘球、弓箭、啦啦隊、摺紙鶴\n從壘球開始，那個操場真的好棒，日本很多人工建築都跟自然融合，看起來就很舒服，台灣的操場雖然現代，但心就是沒有辦法很舒暢，超愛他們的操場，然後日本人真的好熱情、活潑、有活力，跟他們相處就是自在",
        "publishedDate": "5/09",
        "previewImg": "09_01.jpg",
        "docUrl": "https://japan-study-work.s3.amazonaws.com/5:09/01黃亮瑋/01黃亮瑋.pdf"
    },
    {
        "authorName": "連卉媗",
        "content": "在長野商業高校看到了很精彩的表演，有射箭的跳啦啦隊，這兩個去年的體驗也讓我覺得很開心，啦啦隊的學生們都很厲害，後空翻前空翻樣樣，來，很多高難度的動作他們都很完美的展現出來，我覺得他們真的好厲害，我們還一起和長野商業高校的學生體驗壘球，他們細心的教我們投球的細節以及技巧，還一起學習怎麼折紙鶴，一起折了好多好多，最後用兩隻手一起捧著帶回去，最後給他們禮物、交換聯絡方式以及一起拍照，結束了特別的交流活動，整個活動大家都非常的有禮貌，即使語言不通，但並沒有阻礙我們的溝通，這次的訪校讓我印象深刻。",
        "publishedDate": "5/09",
        "previewImg": "09_04.jpg",
        "docUrl": "https://japan-study-work.s3.amazonaws.com/5:09/04連卉媗/04連卉媗.pdf"
    },
    {
        "authorName": "魯奇翰",
        "content": "參觀日本長野商業高校並與學生交流的經驗令我印象深刻也是難得一次的體驗。這所學校的學生充滿活力的迎接我們，學生們展現出令人敬佩的禮儀態度和熱情。在與學生交流的過程中，我深深感受到他們對學習和發展的熱忱。",
        "publishedDate": "5/09",
        "previewImg": "09_13.jpg",
        "docUrl": "https://japan-study-work.s3.amazonaws.com/5:09/13魯奇翰/13魯奇翰.pdf"
    },
    {
        "authorName": "羅建凱",
        "content": "體育課教導棒球的傳接球，老師演示得讓所有人都看得懂\n化學課在教如何透過火焰的顏色猜測金屬，其實與台灣差不多，畢竟元素都是一樣的",
        "publishedDate": "5/09",
        "previewImg": "09_18.jpg",
        "docUrl": "https://japan-study-work.s3.amazonaws.com/5:09/18羅建凱/18羅建凱.pdf"
    },
    {
        "authorName": "廖予嫙",
        "content": "今天去長商參觀他們的校園生活，我發現他們的社團跟台灣差很多，日本他們每天都會參與社團活動，而台灣基本上只有每週短短的幾節課，感覺他們的社團非常的專業，而且大家也都非常重視，像是今天看到的的弓道、競技啦啦隊的表演真的非常厲害，吃飯時間和他們交流的時候覺得他們人都非常好，就算語言不通也會很努力的嘗試，很開心可以加到他們的ig希望之後有機會可以和他們聊天繼續和他們做朋友。",
        "publishedDate": "5/09",
        "previewImg": "09_20.jpg",
        "docUrl": "https://japan-study-work.s3.amazonaws.com/5:09/20廖予嫙/20廖予嫙.pdf"
    },
    {
        "authorName": "黃亮瑋",
        "content": "來了三天還是有很多新地方值得學習，我覺得一拿台灣來比較是完全無法比，台灣人把自己放在第一位，先想如何自己過好，其次才是為別人著想，原本在台灣感受不到那麼多，來日本體會到台灣蠻Low的",
        "publishedDate": "5/10",
        "previewImg": "",
        "docUrl": "https://japan-study-work.s3.amazonaws.com/5:10/01黃亮瑋/01黃亮瑋.pdf"
    },
    {
        "authorName": "連卉媗",
        "content": "今天一早就吃到中村小姐準備的早餐，有味噌湯、鮭魚、雞肉還有沒嘗試過的納豆，納豆的味道我覺得有點像咖啡，但是不甜也不閒，還有點臭臭的，吃了幾顆我覺得不太能接受，這也可以算是特別的體驗吧，接著我們去了農業改良實驗所，吃到了他們改良的黃色蘋果，很甜很脆，還有味道不像蘋果汁的蘋果汁，粉紅粉紅的，不知道的人還以為是果醋，接著看了他們的改良水稻，我覺得他們想得很周到，想到全球暖化所以改良出了耐熱的稻子，未雨綢繆，到時候才不會沒有米可以吃。到東京的時候，給我的感覺就是繁華的都市，我覺得比台灣的台北還要熱鬧，各種高樓大廈，和長野縣是一個非常明顯的對比，在這間飯店的15樓，看著美麗的夜景，非常的愜意。",
        "publishedDate": "5/10",
        "previewImg": "10_04.jpg",
        "docUrl": "https://japan-study-work.s3.amazonaws.com/5:10/04連卉媗/04連卉媗.pdf"
    },
    {
        "authorName": "呂大全",
        "content": "今天早上我5.00起床上了個廁所後，到客廳與叔叔阿姨到了早安，可能是我輕手輕腳的關係他們並沒有察覺到我所以有受到小小的驚嚇，在過完招呼後叔叔問我要喝茶嗎？我表示贊同，而後阿姨端了一壺茶水給我在10度左右的空間一壺熱騰騰的紅茶顯得格外浪漫。",
        "publishedDate": "5/10",
        "previewImg": "10_06.jpg",
        "docUrl": "https://japan-study-work.s3.amazonaws.com/5:10/06呂大全/06呂大全.pdf"
    },
    {
        "authorName": "陳永茂",
        "content": "我覺得今天的日本行讓我學到很多東西，可能我在農業技術方面不是非常的擅長，但也理解到了他們行銷上的一些手法，而不是像台灣台灣的行銷手法可能比較偏集中式就會變成每個人都在做同樣的事情而日本人比較會去做人家沒有做過的是像是蘋果的出產季節，可能今天蘋果是冬季出產，那他們就會在前面的時間或者是後面的時間研發出可以出產的蘋果讓蘋果的季節拉長可能一二月可以吃到富士蘋果然後夏天中旬可以吃到今天這樣的蘋果然後或者是冬天的時候可以吃到一般的蘋果然後今天的二手商鋪的行銷手法也讓我蠻驚訝的",
        "publishedDate": "5/10",
        "previewImg": "10_10.jpg",
        "docUrl": "https://japan-study-work.s3.amazonaws.com/5:10/10陳永茂/10陳永茂.pdf"
    },
    {
        "authorName": "魯奇翰",
        "content": "參觀長野農業試驗場的經驗讓我對農業科技的發展和現代農業的挑戰有了更深入的了解。試驗場充滿了綠意和生機，展示了農業界不斷努力改進的努力。在專業的解說下，我瞭解到試驗場所進行的研究和實驗項目非常多樣化。我參觀了溫室，看到他們利用現代技術種植高效率的作物，這對於解決食物安全和糧食供應的問題具有重要意義。",
        "publishedDate": "5/10",
        "previewImg": "10_13.jpg",
        "docUrl": "https://japan-study-work.s3.amazonaws.com/5:10/13魯奇翰/13魯奇翰.pdf"
    },
    {
        "authorName": "洪若涵",
        "content": "早上在農業關係試驗場的時候，可能因為剛起床，還想睡覺，聽演講的時候直接登出，睡著了，但後面聽到他們是自己研發出了新品種的蘋果、蘋果汁，精神就來了，也有吃到長得像梨子的蘋果，很好吃呢，跟台灣的不一樣，台灣的蘋果我不太喜歡，有種澀澀的感覺，而且很甜，這個蘋果雖然長相不會覺得他是蘋果，但吃起來脆脆的，是淡淡的蘋果香，甜度也恰到好處，會讓人覺得吃一個還不夠呢！",
        "publishedDate": "5/10",
        "previewImg": "10_17.jpg",
        "docUrl": "https://japan-study-work.s3.amazonaws.com/5:10/17洪若涵/17洪若涵.pdf"
    },
    {
        "authorName": "羅建凱",
        "content": "今天的旅程讓我感受到了日本城鄉之間的巨大差異。從較鄉村的長野到了熱鬧的東京，我們見識到了日本城市發展的不同面向。在長野的農業関係試験場，我們了解到了日本人為了因應全球暖化所做出的努力。試驗場所研發的新品種果汁味道獨特，讓我們驚艷不已。此外，我們還了解到了蘋果樹種植的技巧和栽培方式，深入了解了日本的農業文化。",
        "publishedDate": "5/10",
        "previewImg": "10_18.jpg",
        "docUrl": "https://japan-study-work.s3.amazonaws.com/5:10/18羅建凱/18羅建凱.pdf"
    },
    {
        "authorName": "洪翊馨",
        "content": "今天早上開始被分為兩組行動，我們第二組都到了，第一組可能因為人潮非常的壅擠的關係遲到了，但今天的午餐對於我這個素食者來說還不錯，吃得非常的多非常的滿足，中午的賞花和那個巨大的鋼彈也非常的不錯非常酷，但到下午要去吃晚餐的路上電車因為被雷擊中電纜，導致突發狀況，只能坐在原地乾等。但也因為這個突發狀況，我覺得遇到這種狀況又加上下雨回到飯店休息一天疲憊的心，是很正確的事。",
        "publishedDate": "5/11",
        "previewImg": "",
        "docUrl": "https://japan-study-work.s3.amazonaws.com/5:11/02洪翊馨/02洪翊馨.pdf"
    },
    {
        "authorName": "黃彥綸",
        "content": "今天一大早我們坐地鐵道ANA航空供寺參觀，也了解到他們的工作內容，他們其實都很辛苦，在航空業來說並沒有很輕鬆，這項工作須犧牲許多休息時間出航工作服伺我們，也看到他們勤奮的培訓，為未來到航空公司提前訓練準備，真的很羨慕也用很感恩的心去感謝他們的付出。",
        "publishedDate": "5/11",
        "previewImg": "11_03.jpg",
        "docUrl": "https://japan-study-work.s3.amazonaws.com/5:11/03黃彥綸/03黃彥綸.pdf"
    },
    {
        "authorName": "陳永茂",
        "content": "我覺得今天一整天的行程都讓我感到蠻開心的從早上的早餐開始就感受得到滿滿的用心，雖然坐電車走路可能會比較的酸及勞累，但我覺得體驗到這些東西是平常來這裡體驗不到的，而且做過了之後茵發現日本的地鐵是真的非常的方便以及內部規劃的方式也都非常的棒，雖然跟台灣有點雷同，但感覺在小細節方面又更勝台灣一籌到了山下公園到我們迎面而來的就是非常漂亮的花海及撲鼻而來的花香",
        "publishedDate": "5/11",
        "previewImg": "11_10.jpg",
        "docUrl": "https://japan-study-work.s3.amazonaws.com/5:11/10陳永茂/10陳永茂.pdf"
    },
    {
        "authorName": "魯奇翰",
        "content": "首先，體驗了東京電車，真的覺得要能夠熟悉是需要花蠻長一段時間才能了解完整的運作機制，與設計方法，但或許也因為日本一個地區就蠻大的，所以看起來亂也或許是正常的。也從中看到擁有各種顏色的車種，可以辨識一些鐵路的線道，而且在電車的設計方面，每輛車的車廂數也不盡相同，有8或15個車廂的，而且輪子也相對台灣捷運或火車都來的大",
        "publishedDate": "5/11",
        "previewImg": "11_13.jpg",
        "docUrl": "https://japan-study-work.s3.amazonaws.com/5:11/13魯奇翰/13魯奇翰.pdf"
    },
    {
        "authorName": "葉家均",
        "content": "今天早上去參觀了鋼彈工廠，雖然看到許多價格便宜的鋼彈模型，但是想起自己根本沒時間組裝，而且帶回台灣也不方便，就打消了購買的念頭。在這邊印象最深刻的就是隔一段時間就會有巨型鋼彈在移動，做各種姿勢的變化。接著我們搭電車前往ANA全日本空輸參觀，路上因為地震的緣故，電車的搭乘也收到影響，所以抵達時間也延遲了。在參觀過程中令我印象最深刻的就是在模擬飛行的機器，讓我想到了太空人要模擬上宇宙也有類似的機器。",
        "publishedDate": "5/11",
        "previewImg": "",
        "docUrl": "https://japan-study-work.s3.amazonaws.com/5:11/21葉家均/21葉家均.pdf"
    },
    {
        "authorName": "許凱俊",
        "content": "在5級地震的伴隨下，我們開始了美好的一天，凌晨4點的大地震據說警報很吵很大聲，但我一覺到天亮，完全沒有感覺。早餐在飯店享受了自助吧，有一個酷酷的蜂蜜餅，口感很獨特，甜甜的很好吃，我還觀察到在日本很多時候薯條都不像台灣是切好一條一條的，大部分都是像切蘋果那樣一片一片，別有一番風味。",
        "publishedDate": "5/11",
        "previewImg": "",
        "docUrl": "https://japan-study-work.s3.amazonaws.com/5:11/22許凱俊/22許凱俊.pdf"
    },
    {
        "authorName": "黃亮瑋",
        "content": "單純用看的來學習部分越來越難找\n很喜歡實體操作科學的部分，在台灣還是日本都一樣，今天去鐵路博物館也是有科學區，好好玩，我光是把輪子從斜坡放下去，就可以玩一整天\n他們把那麼多的火車頭放在一起，很用心，真的很用心，台灣沒見過這樣的地方，站在火車旁，火車下壓迫感很大，但至少知道躲在鐵軌上是不安全的，會被車底撞",
        "publishedDate": "5/12",
        "previewImg": "12_01.jpg",
        "docUrl": "https://japan-study-work.s3.amazonaws.com/5:12/01黃亮瑋/01黃亮瑋.pdf"
    },
    {
        "authorName": "黃彥綸",
        "content": "今天很開心能到日本當地的釀造醬油及味噌的地方參觀，跟我們介紹了釀造原理及作法，還有品嘗味道，真的是收穫滿滿啊~~~接著就式午餐啦，在他們釀造的地方用餐，吃了用豆腐皮炸的丸子還有味噌湯及燴飯，超級美味的，到了下午我們去了川越老街及冰川神社，說到冰川神社那就是求姻緣的好地方，聽說只要釣到鯉魚就有機會得到愛情，結果我掉到了，心情非常興奮些望能順利脫單~",
        "publishedDate": "5/12",
        "previewImg": "12_03.jpg",
        "docUrl": "https://japan-study-work.s3.amazonaws.com/5:12/03黃彥綸/03黃彥綸.pdf"
    },
    {
        "authorName": "陳宣廷",
        "content": "今天去印刷廠參觀，裡面介紹了他們的印刷技術，他們的做法非常聰明，運用機械手臂進行自動操作，把長滾輪放置好，開始印刷，完成後，反覆操作，都是自動的，連印刷的塑膠膜也可以做到把不同圖案、樣式同時完成，連墨水也是自動補充，員工晚上在睡覺時，機器也是一樣在自動工作，工作人員只要把顧客要的樣式輸入進去，機器都會自動工作，不僅省時又省人力，但因為這樣卻又產生了一個更重要的問題，就是人類的工作越來越少了。",
        "publishedDate": "5/12",
        "previewImg": "12_19.jpg",
        "docUrl": "https://japan-study-work.s3.amazonaws.com/5:12/19陳宣廷/19陳宣廷.pdf"
    },
    {
        "authorName": "葉家均",
        "content": "今天去參觀ヤマキ醸造，了解了許多傳統食品在日本文化中的地位和重要性，還可以品嚐他們許多的豆類食物，午餐也吃了許多與豆類結合的菜色，雖然我個人不是那麼喜歡吃豆類製品，但是我也努力品嚐它們的美味。後來下午去了Think Laboratory參觀他們的高科技印刷術，使用水性墨水，能夠降低對環境的負擔，其中讓我感到最厲害的是，他們印刷時不是使用噴墨的，所以速度非常的快，而且能夠將多個待印刷的內容排程起來去印刷。",
        "publishedDate": "5/12",
        "previewImg": "12_21.jpg",
        "docUrl": "https://japan-study-work.s3.amazonaws.com/5:12/21葉家均/21葉家均.pdf"
    },
    {
        "authorName": "連卉媗",
        "content": "今天主要是體驗動畫繪圖製作，他們提供一個草稿讓我們來清稿，也就是描邊，我覺得很好玩，對於我這個不會畫畫的人來說，描邊還是可以讓我樂在其中，很療癒，不過可惜的是時間不太夠，我沒有畫完，但還是被日本老師誇讚說我畫的很好，成就感就提升了許多，接著我們就來製作背景，拿他們提供的素材來合成一個完整的背景，也可在自己畫上要的東西，這兩項課程我比較喜歡的是電繪的部分，接著我們去了Unqlo，一進門就是很搶眼的櫥窗，很多衣服都在有規律的搖擺，店內衣服的價格是跟台灣的差不多，不過有些是台灣買不到的衣服，像是UT，在裡面看到了海賊王、進擊的巨人、馬力歐等等的衣服。",
        "publishedDate": "5/13",
        "previewImg": "13_04.jpg",
        "docUrl": "https://japan-study-work.s3.amazonaws.com/5:13/04連卉媗/04連卉媗.pdf"
    },
    {
        "authorName": "李翊榮",
        "content": "今天一早就到料理學校去上課看看日本的料理學校去如何教學跟他的上課方式，讓後讓我們下去做料理，很神奇的的事他們的調味很重可是把蘿蔔塊放在下面，然後做完在自己下去吃，結果吃起來沒有到很鹹超級神奇，吃完後先去逛逛學校的廚房後來就上去做傳統的壽司的作法，他們的壽司飯真的很講究不能加完醋拌的過程不能有黏性有的話整鍋就要廢掉，我真的覺得日本的師傅很敬業很認真，是我們要學習的地方，也要切生魚片，再來捏壽司，手法真的有難，師傅也會手把手教學，後來就去銀座吃晚餐，今天在日本看到了許多的手法是台灣沒有的學到了很多。",
        "publishedDate": "5/13",
        "previewImg": "13_09.jpg",
        "docUrl": "https://japan-study-work.s3.amazonaws.com/5:13/09李翊榮/09李翊榮.pdf"
    },
    {
        "authorName": "陳永茂",
        "content": "我覺得他們的上課內容和上課的方式我還蠻喜歡的他們主要都是以實作為主以邊做邊講解的方式來告訴我們讓我們看得到聽得到以最真實的方式呈現在我們眼前也不會因為正在做事手忙腳亂而無法回答問題或是講得很倉促，而是做事井然有序一點都不慌亂更是不吝嗇地回答我們所有的問題即使可能我們問的問題對他們來說很基本沒那麼必要詢問他們也都會非常盡責的來回答第一堂課的老師怕我們太過緊繃還會講個笑話來緩和氣氛",
        "publishedDate": "5/13",
        "previewImg": "13_10.jpg",
        "docUrl": "https://japan-study-work.s3.amazonaws.com/5:13/10陳永茂/10陳永茂.pdf"
    },
    {
        "authorName": "張蕙晴",
        "content": "今天早上到下午製作了兩種料理，分別為像日式定食的套餐組合及握壽司，在這途中彷彿又回到學校上課的日子，但是似乎又有點不一樣，感覺更加的繁雜細緻些。在這一天中收穫了不少技巧與訣竅，師傅們也用有趣的方式帶著我們學習，並且在途中也會來指導我們，一整天的氣氛都很和諧，讓我們在學習過程中相當的愉快。",
        "publishedDate": "5/13",
        "previewImg": "13_12.jpg",
        "docUrl": "https://japan-study-work.s3.amazonaws.com/5:13/12張蕙晴/12張蕙晴.pdf"
    },
    {
        "authorName": "吳宗翰",
        "content": "今天一開始是去TEAMlab藝術廠，裡面的藝術景象真的美不勝收，在經過第一段水道之後，擦完腳我忘記把毛巾放回去了，於是我只好用英文溝通哈哈哈，還好他們應受過訓練，一聽就知道我在說什麼。再來就是去台場海濱公園看風景跟逛街，剛好在吃飯的地方可以看到昨天去的澀谷sky，心想我怎麼會到怎麼高的地方去。",
        "publishedDate": "5/14",
        "previewImg": "",
        "docUrl": "https://japan-study-work.s3.amazonaws.com/5:14/08吳宗翰/08吳宗翰.pdf"
    },
    {
        "authorName": "陳永茂",
        "content": "我覺得他們的上課內容和上課的方式我還蠻喜歡的他們主要都是以實作為主以邊做邊講解的方式來告訴我們讓我們看得到聽得到以最真實的方式呈現在我們眼前也不會因為正在做事手忙腳亂而無法回答問題或是講得很倉促，而是做事井然有序一點都不慌亂更是不吝嗇地回答我們所有的問題即使可能我們問的問題對他們來說很基本沒那麼必要詢問他們也都會非常盡責的來回答第一堂課的老師怕我們太過緊繃還會講個笑話來緩和氣氛",
        "publishedDate": "5/14",
        "previewImg": "14_10.jpg",
        "docUrl": "https://japan-study-work.s3.amazonaws.com/5:14/10陳永茂/10陳永茂.pdf"
    },
    {
        "authorName": "蘇品融",
        "content": "下午坐船前往淺草，小時候跟家人在離島旅遊時對於坐船的印象不看回想，總而言之就是暈一個字，但今天跑到船頂上站立看海上，乘坐時儘管有搖晃但不會有暈車感，乘著海風觀賞沿途的景致使心情愜意，聽到上來的人說坐樓下悶熱且沒有靠窗座，此時蠻慶幸自己上船前選擇這個位置，到了淺草寺除了抽到大吉就沒有什麼令我感到驚艷，畢竟日本的寺廟格局在幾天前就已見識過。",
        "publishedDate": "5/14",
        "previewImg": "14_14.jpg",
        "docUrl": "https://japan-study-work.s3.amazonaws.com/5:14/14蘇品融/14蘇品融.pdf"
    },
    {
        "authorName": "林碩斌",
        "content": "今天我們參觀了TeamLab，其中最讓我感興趣的是Moving Creates Vortices and Vortices Create Movement是一件數字藝術作品，它以水和自然景觀為主題，展示了自然與人造環境之間的互動關係。在這件作品中，觀眾可以看到一個巨大的水池，水池上方掛有數百個LED燈，通過不斷變換的光和色彩，營造出極富戲劇性的視覺效果。這個作品的最大特點是互動性，當觀眾在水池邊行走或投擲物體進入水中時，水中會形成旋渦和波紋，產生經常變幻的圖案和色彩。此外，作品的聲音效果也是通過觀眾的互動來創造的，每當觀眾投擲物體進入水中時，就會產生不同的聲音效果。",
        "publishedDate": "5/14",
        "previewImg": "",
        "docUrl": "https://japan-study-work.s3.amazonaws.com/5:14/16林碩斌/16林碩斌.pdf"
    },
    {
        "authorName": "洪若涵",
        "content": "今天早上體驗了一個這幾天以來最好玩的東西，有很多的藝術作品，其中不只是有視覺，還有觸覺、聽覺、嗅覺的體驗，除了色彩繽紛的燈光饗宴，還有水、地板與以往不同的觸覺體驗，每個場景也都有自己的配樂，有花的地方甚至還有淡淡的花香味，真的很厲害呢！可惜的是第二個展示區東西比較少，只有兩個，但第一個區域就很厲害，如果第二個也可以跟第一個一樣一定會更好玩。",
        "publishedDate": "5/14",
        "previewImg": "",
        "docUrl": "https://japan-study-work.s3.amazonaws.com/5:14/17洪若涵/17洪若涵.pdf"
    },
    {
        "authorName": "葉家均",
        "content": "TeamLab是一個非常有趣和美麗的地方。這裡的藝術展示非常獨特，讓人驚嘆不已。從充滿幻想的立體投影展示到光影交織的互動展覽，每個作品都非常精美，帶給人們無盡的驚喜和啟發。在這裡，您可以感受到藝術與科技完美融合的魅力，並且可以與家人和朋友一起度過一個充滿藝術氛圍的下午。",
        "publishedDate": "5/14",
        "previewImg": "",
        "docUrl": "https://japan-study-work.s3.amazonaws.com/5:14/21葉家均/21葉家均.pdf"
    },
    {
        "authorName": "黃彥綸",
        "content": "今天是最後一天了,很開心這8天和各位金手一起遊學研習參訪,我們也學到了很多我們從未看見的技術也好,文化也好,在日本我真的收穫滿滿,也了解很多從所未有的東西,這趟遊學真的值得了.",
        "publishedDate": "5/15",
        "previewImg": "15_03.jpg",
        "docUrl": "https://japan-study-work.s3.amazonaws.com/5:15/03黃彥綸/03黃彥綸.pdf"
    },
    {
        "authorName": "林哲豪",
        "content": "今天是最後一天在日本教育旅行，非常能夠同時間也非常開心可以和大家認識，並且在許多活動中增加與其他選手的情感，並且在這些交流的過程當中也學習到他們不同的技術以及知識，我覺得對我來講都是非常重要的一個經驗，因為這樣跳脫我原本的學習方式，透過此次的旅行我學到不只我原本的專業以外的東西，這種跨領域的教育方法，我覺得非常的重要也非常的有意義，在這短短的八天你和許多同學建立了非常濃厚的情感在離別的時候也是相當的非常難過，很希望時間不要這麼快就結束。",
        "publishedDate": "5/15",
        "previewImg": "15_11.jpg",
        "docUrl": "https://japan-study-work.s3.amazonaws.com/5:15/11林哲豪/11林哲豪.pdf"
    }
]